todos/app/controllers/api/todos_controller.rb

INSERT INTO "todos" ("title", "body") VALUES ($1, $2) RETURNING "id"  [["title", "fdafa"], ["body", "fdafa"]]
---
  def create
    todo = Todo.new(todo_params)
    if todo.save